app/controllers/songs_controller.rb

  def index
    if Artist.find(params[:artist_id])
      binding.pry
    @songs = Artist.find(params[:artist_id]).songs
  else
    @songs = Song.all
---
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
SELECT "artists".* FROM "artists"