app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
    @artist = Artist.find_by_id(params[:artist_id])
      if @artist.nil?
        redirect_to artists_path
      end
  else
    @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 0]]
SELECT "songs".* FROM "songs"

  def show
    @song = Song.find(params[:id])
    @artist = Artist.find_by_id(params[:artist_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]